
mbti_statement = {    
    'INTJ' :  ('建築師','富有想象力和戰略性的思想家，一切皆在計劃之中。'),
    'INTP' :  ('邏輯學家','具有創造力的發明家，對知識有著止不住的渴望。'),
    'ENTJ' :  ('指揮官','大膽，富有想象力'),
    'ENTP' :  ('辯論家','聰明好奇的思想者，不會放棄任何智力上的挑戰。'),

    'INFJ' :  ('提倡者','安靜而神秘，同時鼓舞人心且不知疲倦的理想主義者。'),
    'INFP' :  ('調停者','詩意，善良的利他主義者，總是熱情地為正當理由提供幫助。'),
    'ENFJ' :  ('主人公','富有魅力鼓舞人心的領導者，有使聽眾著迷的能力。'),
    'ENFP' :  ('競選者' '熱情，有創造力愛社交的自由自在的人，總能找到理由微笑。'),

    'ISTJ' :  ('物流師','實際且註重事實的個人，可靠性不容懷疑。'),
    'ISFJ' :  ('守衛者','非常專註而溫暖的守護者，時刻準備著保護愛著的人們。'),
    'ESTJ' :  ('總經理','出色的管理者，在管理事情或人的方面無與倫比。'),
    'ESFJ' :  ('執政官','極有同情心，愛交往受歡迎的人們，總是熱心提供幫助。'),

    'ISTP' :  ('鑒賞家','大膽而實際的實驗家，擅長使用任何形式的工具。'),
    'ISFP' :  ('探險家','靈活有魅力的藝術家，時刻準備著探索和體驗新鮮事物。'),
    'ESTP' :  ('企業家','聰明，精力充沛善於感知的人們，真心享受生活在邊緣。'),
    'ESFP' :  ('表演者','自發的，精力充沛而熱情的表演者－生活在他們周圍永不無聊。')
}