
mbti_statement = {
    'INTJ' :  ('建筑师','富有想象力和战略性的思想家，一切皆在计划之中。'),
    'INTP' :  ('逻辑学家','具有创造力的发明家，对知识有着止不住的渴望。'),
    'ENTJ' :  ('指挥官','大胆，富有想象力'),
    'ENTP' :  ('辩论家','聪明好奇的思想者，不会放弃任何智力上的挑战。'),

    'INFJ' :  ('提倡者','安静而神秘，同时鼓舞人心且不知疲倦的理想主义者。'),
    'INFP' :  ('调停者','诗意，善良的利他主义者，总是热情地为正当理由提供帮助。'),
    'ENFJ' :  ('主人公','富有魅力鼓舞人心的领导者，有使听众着迷的能力。'),
    'ENFP' :  ('竞选者' '热情，有创造力爱社交的自由自在的人，总能找到理由微笑。'),

    'ISTJ' :  ('物流师','实际且注重事实的个人，可靠性不容怀疑。'),
    'ISFJ' :  ('守卫者','非常专注而温暖的守护者，时刻准备着保护爱着的人们。'),
    'ESTJ' :  ('总经理','出色的管理者，在管理事情或人的方面无与伦比。'),
    'ESFJ' :  ('执政官','极有同情心，爱交往受欢迎的人们，总是热心提供帮助。'),

    'ISTP' :  ('鉴赏家','大胆而实际的实验家，擅长使用任何形式的工具。'),
    'ISFP' :  ('探险家','灵活有魅力的艺术家，时刻准备着探索和体验新鲜事物。'),
    'ESTP' :  ('企业家','聪明，精力充沛善于感知的人们，真心享受生活在边缘。'),
    'ESFP' :  ('表演者','自发的，精力充沛而热情的表演者－生活在他们周围永不无聊。')
}